/*
Navicat MySQL Data Transfer

Source Server         : 10.127.133.150
Source Server Version : 50718
Source Host           : 10.127.133.150:43306
Source Database       : bigdata_ecf_bi

Target Server Type    : MYSQL
Target Server Version : 50718
File Encoding         : 65001

Date: 2017-07-12 17:03:07
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `wy_hr`
-- ----------------------------
DROP TABLE IF EXISTS `wy_hr`;
CREATE TABLE `wy_hr` (
  `employee_name` varchar(50) DEFAULT NULL COMMENT '员工姓名',
  `idcard` varchar(50) DEFAULT NULL,
  `mobile_phone` varchar(50) NOT NULL DEFAULT '' COMMENT '手机号',
  `ems_id` varchar(50) DEFAULT NULL COMMENT 'ems号',
  `employee_id` varchar(52) NOT NULL DEFAULT '' COMMENT '人事范围编码',
  `sex` varchar(2) NOT NULL DEFAULT '',
  `age` varchar(23) DEFAULT NULL,
  `entry_date` varchar(50) DEFAULT NULL COMMENT '入职日期',
  `quit_date` varchar(50) NOT NULL DEFAULT '',
  `service_years` decimal(10,4) DEFAULT NULL,
  `company_name` varchar(100) DEFAULT NULL COMMENT '公司名称',
  `service_status` varchar(5) NOT NULL DEFAULT '',
  `phasename` varchar(250) DEFAULT NULL,
  `loan_unfinish_amt` decimal(47,6) DEFAULT NULL,
  `leave_control` varchar(79) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of wy_hr
-- ----------------------------
INSERT INTO `wy_hr` VALUES ('虞舒雅', '440507198811070628', '', '110706280', '00100056', 'F', '28', '2011-07-17', '', '5.9671', '互联网金融集团', '正式员工', '已批准', '0.000000', '暂停办理离职手续，请与互金集团接口人XXX联系，并提醒员工结清贷款，再行办理离职手续可办理离职手续；（适用于有在贷中、已审批未放款、申请中等状态员工贷的员工）');
INSERT INTO `wy_hr` VALUES ('董皓文', '440102198607104014', '13632356574', '071040140', '00118625', 'M', '30', '2013-07-16', '', '3.9671', '互联网金融集团', '正式员工', '正常', '1000.000000', '暂停办理离职手续，请与互金集团接口人XXX联系，并提醒员工结清贷款，再行办理离职手续可办理离职手续；（适用于有在贷中、已审批未放款、申请中等状态员工贷的员工）');
INSERT INTO `wy_hr` VALUES ('杜亮', '511321198207064913', '18928763333', '070649130', '00126038', 'M', '34', '2012-04-05', '', '5.2466', '互联网金融集团', '正式员工', '已批准', '0.000000', '暂停办理离职手续，请与互金集团接口人XXX联系，并提醒员工结清贷款，再行办理离职手续可办理离职手续；（适用于有在贷中、已审批未放款、申请中等状态员工贷的员工）');
INSERT INTO `wy_hr` VALUES ('周敏聪', '440682199110166010', '', '720223020', '00396949', 'M', '25', '2014-07-25', '', '2.9425', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('王雷', '130632199207146415', '', '071464150', '00462646', 'M', '24', '2015-07-03', '', '2.0027', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('杜鹏', '360731198407120030', '', '071200301', '00485216', 'M', '32', '2015-10-19', '', '1.7068', '互联网金融集团', '正式员工', '正常', '1000.000000', '暂停办理离职手续，请与互金集团接口人XXX联系，并提醒员工结清贷款，再行办理离职手续可办理离职手续；（适用于有在贷中、已审批未放款、申请中等状态员工贷的员工）');
INSERT INTO `wy_hr` VALUES ('王一', '370923198601152215', '', '011522150', '00485222', 'M', '31', '2015-10-19', '', '1.7068', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('赵鹏', '370402198106058011', '', '060580110', '00487697', 'M', '36', '2015-10-30', '', '1.6767', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('杨亚', '310109198601310576', '', '013105760', '00489472', 'M', '31', '2015-11-09', '', '1.6493', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('张洁慧', '310115198010293273', '', '102932730', '00498456', 'M', '36', '2015-12-21', '', '1.5342', '互联网金融集团', '正式员工', '已批准', '0.000000', '暂停办理离职手续，请与互金集团接口人XXX联系，并提醒员工结清贷款，再行办理离职手续可办理离职手续；（适用于有在贷中、已审批未放款、申请中等状态员工贷的员工）');
INSERT INTO `wy_hr` VALUES ('黎信宇', '450821198708141593', '', '081415930', '00501239', 'M', '29', '2015-12-25', '', '1.5233', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('孙德君', '210604198411040327', '', '110403270', '00504833', 'F', '32', '2016-01-15', '', '1.4658', '互联网金融集团', '正式员工', '已批准', '0.000000', '暂停办理离职手续，请与互金集团接口人XXX联系，并提醒员工结清贷款，再行办理离职手续可办理离职手续；（适用于有在贷中、已审批未放款、申请中等状态员工贷的员工）');
INSERT INTO `wy_hr` VALUES ('李芸', '320623198112110043', '', '121100430', '00505633', 'F', '35', '2016-01-25', '', '1.4384', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('于红光', '410222198502095532', '', '020955320', '00515648', 'M', '32', '2016-03-17', '', '1.2959', '互联网金融集团', '正式员工', '提前结清', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('李鑫', '320681199109134456', '13764732723', '091344560', '00570338', 'M', '25', '2016-10-31', '', '0.6712', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('张凯', '410181198210275018', '18038015148', '102750180', '00584857', 'M', '34', '2016-12-26', '', '0.5178', '互联网金融集团', '正式员工', '已批准', '0.000000', '暂停办理离职手续，请与互金集团接口人XXX联系，并提醒员工结清贷款，再行办理离职手续可办理离职手续；（适用于有在贷中、已审批未放款、申请中等状态员工贷的员工）');
INSERT INTO `wy_hr` VALUES ('林宙', '440203198704242111', '18682010284', '042421110', '00588244', 'M', '30', '2017-02-09', '', '0.3945', '互联网金融集团', '正式员工', '已否决', '0.000000', '可办理离职手续；（适用于除第1点之外情况的员工）');
INSERT INTO `wy_hr` VALUES ('肖倩', '431103198804030929', '13632752961', '040309290', '00589084', 'F', '29', '2017-02-13', '', '0.3836', '互联网金融集团', '正式员工', '已批准', '0.000000', '暂停办理离职手续，请与互金集团接口人XXX联系，并提醒员工结清贷款，再行办理离职手续可办理离职手续；（适用于有在贷中、已审批未放款、申请中等状态员工贷的员工）');
