/*
Navicat MySQL Data Transfer

Source Server         : 10.127.133.150
Source Server Version : 50718
Source Host           : 10.127.133.150:43306
Source Database       : bigdata_ecf_bi

Target Server Type    : MYSQL
Target Server Version : 50718
File Encoding         : 65001

Date: 2017-07-12 17:03:16
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `wy_marketing`
-- ----------------------------
DROP TABLE IF EXISTS `wy_marketing`;
CREATE TABLE `wy_marketing` (
  `employee_name` varchar(50) DEFAULT NULL COMMENT '员工姓名',
  `idcard` varchar(50) DEFAULT NULL,
  `mobile_phone` varchar(50) NOT NULL DEFAULT '' COMMENT '手机号',
  `ems_id` varchar(50) DEFAULT NULL COMMENT 'ems号',
  `employee_id` varchar(52) NOT NULL DEFAULT '' COMMENT '人事范围编码',
  `sex` varchar(2) NOT NULL DEFAULT '',
  `age` varchar(23) DEFAULT NULL,
  `entry_date` varchar(50) DEFAULT NULL COMMENT '入职日期',
  `quit_date` varchar(50) DEFAULT NULL,
  `is_vip` varchar(1) NOT NULL DEFAULT '',
  `grp_service_years` varchar(10) NOT NULL DEFAULT '',
  `company_name` varchar(100) DEFAULT NULL COMMENT '公司名称',
  `service_status` varchar(5) NOT NULL DEFAULT '',
  `special_title` varchar(32) DEFAULT NULL,
  `is_special` varchar(1) NOT NULL DEFAULT '',
  `serialno` varchar(40) NOT NULL DEFAULT '',
  `inputtime` varchar(20) DEFAULT NULL,
  `phasename` varchar(250) DEFAULT NULL,
  `loan_unfinish_amt` decimal(47,6) DEFAULT NULL,
  `familyAddress` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin,
  `salary` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin,
  `apply_amt` decimal(24,6) DEFAULT NULL,
  `app_endtime` varchar(20) DEFAULT NULL,
  `is_app_reject` varchar(1) NOT NULL DEFAULT '',
  `app_reject_reason` varchar(255) DEFAULT NULL,
  `approval_amt` varchar(26) DEFAULT NULL,
  `signdate` varchar(10) DEFAULT NULL,
  `sign_amt` varchar(26) DEFAULT NULL,
  `putoutdate` varchar(20) DEFAULT NULL,
  `putoutamt` varchar(22) DEFAULT NULL,
  `businessterm` varchar(26) DEFAULT NULL,
  `businessrate_cut` varchar(26) DEFAULT NULL,
  `businessrate_rate` varchar(26) DEFAULT NULL,
  `businessrate_fee` varchar(26) DEFAULT NULL,
  `businessrate_fin` varchar(26) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of wy_marketing
-- ----------------------------
INSERT INTO `wy_marketing` VALUES ('董皓文', '440102198607104014', '13632356574', '071040140', '00118625', 'M', '30', '2013-07-16', '', '否', '02.[3,5)年', '互联网金融集团', '正式员工', '', '否', '2017062800000004', '2017/06/28 11:44:26', '正常', '1000.000000', 0xE5B9BFE5B79EE5B882E8B68AE7A780E58CBAE58588E78388E4B8ADE8B7AF3831E58FB7E5A4A7E999A23439E58FB7353031, 0x38363030, '200000.000000', '2017/07/03 15:59:33', '否', '', '1000.000000', '2017/07/03', '1000.000000', '2017/07/04', '1000.00', '6.000000', '1.000000', '4.780000', '3.000000', '9.560000');
INSERT INTO `wy_marketing` VALUES ('杜鹏', '360731198407120030', '', '071200301', '00485216', 'M', '32', '2015-10-19', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017061900000401', '2017/06/19 15:53:23', '正常', '1000.000000', 0xE4B88AE6B5B7E58A9BE5AE9DE5B9BFE59CBA, 0x3230303030, '100000.000000', '2017/06/20 17:03:23', '否', '', '1000.000000', '2017/06/20', '1000.000000', '2017/06/22', '1000.00', '12.000000', '1.000000', '4.780000', '3.000000', '9.560000');
INSERT INTO `wy_marketing` VALUES ('于红光', '410222198502095532', '', '020955320', '00515648', 'M', '32', '2016-03-17', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017062000000001', '2017/06/20 16:38:40', '提前结清', '0.000000', 0xE4B88AE6B5B7E5B882E6B7AEE6B5B7E4B8ADE8B7AF323232E58FB7E58A9BE5AE9DE5B9BFE59CBA313246, 0x3236383838, '300000.000000', '2017/06/21 10:20:46', '否', '', '1000.000000', '2017/06/30', '1000.000000', '2017/07/03', '1000.00', '12.000000', '1.000000', '4.780000', '3.000000', '9.560000');
INSERT INTO `wy_marketing` VALUES ('虞舒雅', '440507198811070628', '', '110706280', '00100056', 'F', '28', '2011-07-17', '', '否', '03.[5,10)年', '互联网金融集团', '正式员工', '', '否', '2017063000000001', '2017/06/30 15:12:37', '已批准', '0.000000', 0xE4BF9DE588A9E5BF83E8AFADE88AB1E59BAD46373036, null, '3000000.000000', '2017/07/07 11:16:07', '否', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('杜亮', '511321198207064913', '18928763333', '070649130', '00126038', 'M', '34', '2012-04-05', '', '否', '03.[5,10)年', '互联网金融集团', '正式员工', '', '否', '2017062000000002', '2017/06/20 16:40:09', '已批准', '0.000000', 0xE5B9BFE5B79EE5B882E88D94E6B9BEE58CBAE7BFA0E7ABB9E8A1973738E58FB7E7BFA0E7ABB9E88B9142332D333037, 0x3332303030, '2300000.000000', '2017/07/05 10:25:13', '否', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('周敏聪', '440682199110166010', '', '720223020', '00396949', 'M', '25', '2014-07-25', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017070300000001', '2017/07/03 15:04:21', '已否决', '0.000000', 0xE68192E5A4A7E585ACE5AF93, 0x35303030, '2000.000000', '2017/07/06 16:01:28', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('王雷', '130632199207146415', '', '071464150', '00462646', 'M', '24', '2015-07-03', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017062800000001', '2017/06/28 09:07:17', '已否决', '0.000000', 0xE5B9BFE5B79EE5B882E5A4A9E6B2B3E58CBAE68192E5A4A7E585ACE5AF93, 0x39353030, '5000.000000', '2017/07/04 13:00:16', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('王一', '370923198601152215', '', '011522150', '00485222', 'M', '31', '2015-10-19', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017062800000002', '2017/06/28 10:29:54', '已否决', '0.000000', 0xE6B5A6E4B89CE696B0E58CBAE88EB2E4B8ADE8B7AF333337E5BC84, 0x3237333030, '100000.000000', '2017/06/28 10:30:43', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('赵鹏', '370402198106058011', '', '060580110', '00487697', 'M', '36', '2015-10-30', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017062700000001', '2017/06/27 09:20:38', '已否决', '0.000000', 0xE4B88AE6B5B7E997B5E8A18CE58CBA, 0x3336303030, '1000.000000', '2017/06/27 09:21:43', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('杨亚', '310109198601310576', '', '013105760', '00489472', 'M', '31', '2015-11-09', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017061600000002', '2017/06/16 20:30:06', '已否决', '0.000000', 0xE4B88AE6B5B7E5B882E899B9E58FA3E58CBAE5B9BFE4B8ADE8B7AF, 0x313530303030, '200000.000000', '2017/06/16 20:30:28', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('张洁慧', '310115198010293273', '', '102932730', '00498456', 'M', '36', '2015-12-21', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017062700000002', '2017/06/27 14:07:22', '已批准', '0.000000', 0xE8A5BFE890A5E8B7AF313138E58FB731393033E5AEA4, 0x3133303030, '30000.000000', '2017/07/05 17:47:12', '否', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('黎信宇', '450821198708141593', '', '081415930', '00501239', 'M', '29', '2015-12-25', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017062800000003', '2017/06/28 11:29:20', '已否决', '0.000000', 0xE5B9BFE5B79EE5B882E5A4A9E6B2B3E58CBAE9BB84E59F94E5A4A7E98193E8A5BF3738E58FB73235E5B182, 0x3133383030, '250000.000000', '2017/07/03 15:54:40', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('孙德君', '210604198411040327', '', '110403270', '00504833', 'F', '32', '2016-01-15', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017061400000001', '2017/06/13 22:22:58', '已批准', '0.000000', 0xE4B88AE6B5B7E6B5A6E4B89CE696B0E58CBA, 0x313233343536, '630000.000000', '2017/06/15 19:14:16', '否', '', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('李芸', '320623198112110043', '', '121100430', '00505633', 'F', '35', '2016-01-25', '', '否', '01.[1,3)年', '互联网金融集团', '正式员工', '', '否', '2017062900000001', '2017/06/29 14:18:41', '已否决', '0.000000', 0xE4B88AE6B5B7E5B882E4B89CE5AE89E4B880E69D913435E58FB7343032, 0x3139303030, '1000.000000', '2017/06/29 14:19:44', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('李鑫', '320681199109134456', '13764732723', '091344560', '00570338', 'M', '25', '2016-10-31', '', '否', '00.[0,1)年', '互联网金融集团', '正式员工', '', '否', '2017070500000001', '2017/07/05 13:44:31', '已否决', '0.000000', 0xE6B19FE88B8FE79C81E590AFE4B89CE5B882E7BFA1E7BFA0E88B9134E6A08B333031, 0x37333030, '5000.000000', '2017/07/05 13:45:51', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('张凯', '410181198210275018', '18038015148', '102750180', '00584857', 'M', '34', '2016-12-26', '', '否', '00.[0,1)年', '互联网金融集团', '正式员工', '', '否', '2017061500000001', '2017/06/13 11:53:13', '已批准', '0.000000', 0xE5B9BFE4B89CE79C81E6B7B1E59CB3E5B882E58D97E5B1B1E58CBAE58D97E58589E8B7AF32E58FB7, 0x3130303030, '300000.000000', '2017/06/16 19:20:10', '否', '', '1000.000000', '2017/06/16', '1000.000000', '', '', '12.000000', '0.000000', '5.650000', '5.000000', '11.300000');
INSERT INTO `wy_marketing` VALUES ('林宙', '440203198704242111', '18682010284', '042421110', '00588244', 'M', '30', '2017-02-09', '', '否', '00.[0,1)年', '互联网金融集团', '正式员工', '', '否', '2017061900000001', '2017/06/17 14:19:41', '已否决', '0.000000', 0xE6B7B1E59CB3E5B882E9BE99E5B297E58CBAE6989FE6B2B3E697B6E4BBA3E88AB1E59BAD, 0x3235303030, '500000.000000', '2017/06/19 14:19:58', '是', '进件申请审批拒绝', '', '', '', '', '', '', '', '', '', '');
INSERT INTO `wy_marketing` VALUES ('肖倩', '431103198804030929', '13632752961', '040309290', '00589084', 'F', '29', '2017-02-13', '', '否', '00.[0,1)年', '互联网金融集团', '正式员工', '', '否', '2017061500000401', '2017/06/15 20:34:55', '已批准', '0.000000', 0xE6B7B1E59CB3E5B882E5898DE6B5B7E8B7AFE8AFBAE5BEB7, 0x3530303030, '500000.000000', '2017/06/15 20:56:58', '否', '', '', '', '', '', '', '', '', '', '', '');
